# Tatiana Kletsovka
# \033[0;__;__m \033[m   or   \033[1;__;__m \033[m
# print('#' * 115)      # Для разделения блоков на листе с кодом:
""" ################################################################################################################
 0.03.25
 Python 5: SUMMARY - Функциональное программирование на Python. Модуль itertools.
 ################################################################################################################### """

# Video Lesson 5: ---------------.
# Video Practice __: wasn't.
# links:
#   - .
#   - .

# def input_numb_list():
#     numb_list = [int(x) for x in input('Enter a list of numbers separated by space: ').split()]
#     return numb_list
# ------------------------ SHORTCUTS ------------------------
# Ctrl + W - выделить текущий блок. если нажимать это сочетание дальше, то будут выделяться родительские блоки.
# Ctrl+Y - Удаление всей строки. Кстати, команда копирования Ctrl+C без выделения также работает для всей строки.
# Alt+Enter - Привести код к принятым стандартам (для Python - PEP8).
# Ctrl+R — Изменить название класса/функции и т. п. по всему проекту.
# Shift + F6 - заменить имя элемента во всех частях во всех файлах.
# -----------------------------------------------------------

print('.' * 120)

""" ___________________________________  Review of previously covered material  ___________________________________ """

""" ______ HW 26, Task 2 ______ """
# -------------------------------------------------------- From Taniya 9:19 - Good EXAMPLE
# import sys
# import os
#
# args = sys.argv
# os.chdir(args[1])
# cur_dir = os.getcwd()
#
# if os.path.exists(cur_dir ):
#     if os.path.isdir(cur_dir ):
#         for root, dirs, files in os.walk(cur_dir):
#             for dir_ in dirs :
#                 print("------------------------ Current", root, dir_, "---------------------", sep="---")
#                 print(os.path.join(root,dir_))
#             for file in files :
#                 print(os.path.join(root, file))
#     else :
#         print('Это не каталог ')
# else :
#     print('Такого пути не существует ')




""" ______  Task 1  ______________________________________________________________________________________________ """

