# Tatiana Kletsovka
# \033[0;__;__m \033[m   or   \033[1;__;__m \033[m
# print('#' * 115)      # Для разделения блоков на листе с кодом:
""" ################################################################################################################
 28.03.25
 Python 63: SUMMARY - Decorators. Methods of Class.
 ################################################################################################################### """
# Video Lesson 63: ------------.
# Video Practice __: wasn't.
# links:
#   - Presentation:
#   -
#
# def input_numb_list():
#     numb_list = [int(x) for x in input('Enter a list of numbers separated by space: ').split()]
#     return numb_list
# ------------------------ SHORTCUTS ------------------------
# Ctrl + W - выделить текущий блок. если нажимать это сочетание дальше, то будут выделяться родительские блоки.
# Ctrl+Y - Удаление всей строки. Кстати, команда копирования Ctrl+C без выделения также работает для всей строки.
# Alt+Enter - Привести код к принятым стандартам (для Python - PEP8).
# Ctrl+R — Изменить название класса/функции и т. п. по всему проекту.
# Shift + F6 - заменить имя элемента во всех частях во всех файлах.
# -----------------------------------------------------------

print('.' * 120)

""" ___________________________________  Review of previously covered material  ___________________________________ """

# Video 63, 26:00 - Использовать ИТЕРАТОР, например, zip(), для перебора и сравнения элементов из 2 коллекций:
# *types и *args. А из одной коллекции ИТЕРАТОР типа map() или filter().

""" __ NB! __ """           # Video 63, 46:00 - Так же очень интересно для ПРОВЕРКИ типов данных
# isinstance(<func>, (int, float)). ++++  Video 63, 56:00 - расписана домашка по *types и *args.



""" %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%_____________   ---   ____________%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% """
#

""" __________ --- __________ """
#       ●

# ___ EXAMPLE _____________________________________________________________________________________

# ___ END of Example _____________________________________________________________________________________



""" ______  Task 1  ______________________________________________________________________________________________ """
#






