# Tatiana Kletsovka
# \033[0;__;__m \033[m   or   \033[1;__;__m \033[m
# print('#' * 115)      # Для разделения блоков на листе с кодом:
# ###################################################################################################################
# 07.02.25
# Python 39: Summary - Sets. Dictionaries.
# ###################################################################################################################
# def input_numb_list():
#     numb_list = [int(x) for x in input('Enter a list of numbers separated by space: ').split()]
#     return numb_list
print('.' * 145)


# %%%%%%%%%%%%%%%%%%%%%%%%%%%_______________    Home Work 19, 03.02.25    _______________%%%%%%%%%%%%%%%%%%%%%%%%%%%
# See Video !!!!

# ______  Task 1  ___________________________________________________________________________________________________
# 1. **Уникальные по порядку**
# Напишите программу, которая принимает список чисел и возвращает список только уникальных чисел в порядке их появления.
# **Данные:**
# numbers = [4, 1, 7, 6, 2, 6, 8, 1, 5, 4]
# **Пример вывода:**
# Уникальные: [4, 1, 7, 6, 2, 8, 5]

def is_unique(numbs):
    res = set(numbs)                            # Эту задачу НЕ решАли.  Video 39 - 1:18:50
    return len(res)

numbers = [4, 1, 7, 6, 2, 6, 8, 1, 5, 4]
print(f'Number of unique simbols = ', is_unique(numbers))

# ______  Task 2  ___________________________________________________________________________________________________
# **Зеркальное подмножество**
# Напишите программу, которая проверяет, являются ли элементы одного из множеств подмножеством другого.
# В случае положительного ответа возвращает разницу между двумя множествами.
# Проверить необходимо в обе стороны.
# **Данные:**
# set1 = {2, 3, 4, 5, 6}
# set2 = {4, 5}
# **Пример вывода:**
# Подмножество: True
# Разница: {2, 3, 6}
# def subset_dif(set1, set):
#     dif = set1 - set
#     return dif
#
# set1 = {2, 3, 4, 5, 6}
# set2 = {4, 5}
# print(subset_dif(set1, set2))

# def subset_dif(set1, set2):
#     issubset1 = set1.issubset(set2)
#     issubset2 = set2.issubset(set1)
#     subst_exist = issubset1 or issubset2
#     if not subst_exist:
#         return  subst_exist
#     if issubset1:
#         if issubset2:
#             difference = set1 - set2
#         else:
#             difference = set2 - set1
#         print("Разница:", difference)
#
# set1 = {2, 3, 4, 5, 6}
# set2 = {4, 5}
# print(subset_dif(set1, set2))